<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------
    'template'               => [
        // 模板引擎类型 支持 php think 支持扩展
        'view_suffix'  => 'htm',//支持模板文件以htm结尾
    ],

    'view_replace_str'  =>  [
    '__PUBLIC__'=>'/public/',
    '__ROOT__' => '/',
//  '__ADMINT__' => 'http://www.tp5.com/static/admin',//这里存放的是admin的静态资源文件
    '__ADMIN__' => 'http://10.118.35.182/tp5/public/static/admin',//这里存放的1是admin的静态资源文件
//  '__UTI__' => 'http://10.118.35.182/tp5/public',//这里存放的是admin的静态资源文件
    ],
];
